{"classes":["NEGATIVE"],"annotations":[["Apple Fined $8.5 for Illegally Collecting iPhone Owners' Data for Ads\r",{"entities":[[6,13,"NEGATIVE"]]}],["Apple Joins Amazon as Second Company to Lose $1 Trillion in Value in 2022\r",{"entities":[[40,46,"NEGATIVE"]]}],["French privacy watchdog fines Apple over personalised ads - Reuters\r",{"entities":[]}],["Exclusive: Apple supplier BOE plans new factories in Vietnam ... - Reuters\r",{"entities":[]}],["Apple's market value falls below $2 trillion for the first time since 2021 - Reuters.com\r",{"entities":[[8,26,"NEGATIVE"]]}],["Former Apple privacy chief will help lead practice at law firm Gibson ... - Reuters\r",{"entities":[]}],["Apple to sign Luxshare for iPhone production in China - FT - Reuters\r",{"entities":[]}],["Amazon's expanded job cuts will affect over 18,000 employees\r",{"entities":[[18,26,"NEGATIVE"]]}],["Amazon to lay off over 17000 workers - WSJ - Reuters\r",{"entities":[[10,17,"NEGATIVE"]]}],["Amazon, Twitch hit with patent lawsuit over streaming technology - Reuters\r",{"entities":[[31,38,"NEGATIVE"]]}],["Amazon workers at UK warehouse to strike on Jan. 25 - union - Reuters UK\r",{"entities":[]}],["Amazon layoff signals more pain for tech sector as recession fears ... - Reuters\r",{"entities":[[7,13,"NEGATIVE"]]}],["Amazon isn't done cutting jobs, announces biggest layoff in its history\r",{"entities":[[50,56,"NEGATIVE"]]}],["‘Lack of respect’: outcry over Amazon employee’s death on warehouse floor\r",{"entities":[[49,54,"NEGATIVE"]]}],["Amazon to shut three UK warehouses, putting 1,200 jobs at risk\r",{"entities":[[50,62,"NEGATIVE"]]}],["Seattle Schools Sue TikTok, Facebook, Instagram, Snapchat, and YouTube Over Students' Mental Health\r",{"entities":[[16,19,"NEGATIVE"]]}],["Two months after mass Twitter layoffs, affected employees still waiting for severance offers\r",{"entities":[[30,37,"NEGATIVE"]]}],["Twitter hacked, 200 million user email addresses leaked, researcher ... - Reuters\r",{"entities":[[8,14,"NEGATIVE"]]}],["Bajaj Finance shares plunge over 7% as co reports moderation in loan growth\r",{"entities":[[14,27,"NEGATIVE"]]}],["Bajaj twins stock dives nearly 10% in 3-day selloff. Should you invest? | Mint - Mint\r",{"entities":[[12,23,"NEGATIVE"]]}],["Bajaj Finance shareholders get ready for a significant phase of below average returns: Sandip Sabharwal\r",{"entities":[[64,77,"NEGATIVE"]]}],["Bajaj Holdings shares drop 2.62% as Sensex rises\r",{"entities":[[15,26,"NEGATIVE"]]}],["Bajaj Holdings shares fall 1.52% as Nifty drops\r",{"entities":[[15,26,"NEGATIVE"],[36,47,"NEGATIVE"]]}],["Share price of Bajaj Holdings falls as Nifty weakens\r",{"entities":[]}]]}